{"title":"National Anthem","description":"Tk","url":"https://pudding.cool/","keywords":"Tk","hed":"Please rise and <strong class=enable-audio>enable your audio</strong> for a stirring analysis of the United States <h1>National Anthem</h1>","dek":"An exploration of rhythm and grooves that break the rules","byline":"By <a href=https://pudding.cool/author/jan-diehm/ target=_blank>Jan Diehm</a> and <a href=https://pudding.cool/author/michelle-mcghee/ target=_blank>Michelle McGhee</a>","intro":[{"text":"When you think of legendary national anthem performances, there’s a good chance <span>Whitney Houston’s</span> 1991 Super Bowl rendition tops your list. More than 30 years later, and it’s still widely considered one of the best, if not the best, national anthem performances of all time.","isolate":"whitney-houston_super-bowl_1991"},{"text":"Then there’s <span>Fergie’s</span> viral performance from the 2018 NBA All-Star game. It’s also considered one of the most memorable national anthems, but for entirely different reasons.","isolate":"fergie_nba-allstar-game_2018"},{"text":"The “Star Spangled Banner” has become a pop culture moment. For the iconic song, each performer must make a calculated choice: stay classic and traditional or infuse it with flair and Mariah Carey-level high notes. <span>Maya Rudolph’s</span> SNL performance is probably one of the most extreme paths you could choose."},{"text":"Let’s look at the paths that 138 performers choose. These lines show celebrity national anthem renditions at major sporting and political events. The lines track pitch (or frequency): the lower the line, the lower the notes and the higher the line the higher the notes."},{"text":"Now, let’s overlay these pitch lines with notes from a standard instrumental version of the anthem played by the United States Navy Band. We’ve stretched the standard version to the average tempo of our 138 performances so it’s a bit easier to compare."},{"text":"But, we can do better. You miss a lot of the variation and nuance when looking at the full anthem, so let’s split it up into 16 phrases at natural pauses or breaths."}],"slides":[{"i":"0","phraseI":"0","type":"phrase","lyrics":"o say can you see","steps":[{"text":"Let’s zoom in to the first phrase, “O say can you see?” Francis Scott Key penned this opening line after seeing the American flag defiantly flying over Fort McHenry after withstanding a bombardment by British forces during the War of 1812."},{"text":"The “Star Spangled Banner” didn’t become the United States’ official anthem until nearly a century later in 1931, and the anthem wasn’t thrust into the pop culture spotlight until the late 1960s when <a href=https://www.youtube.com/watch?v=aQkY2UFBUb4>José Feliciano</a> and <href=https://www.youtube.com/watch?v=sjzZh6-h9fM>Jimi Hendrix</a> put their spin on the <span class=playable data-id=standard>standard melody</span>."},{"text":"It’s this spin we’re interested in — the difference between an artists’ rendition and the standard — and to measure it we’ve created what we’re calling the <strong>Diva Score</strong> (see <a href=#>methods</a> for all the nerdy details). First, we’ve transposed the performances into the same key. For this first phrase, most keep it pretty simple like <span class=playable data-id=amber-riley_mlb-allstar-game_2010>Amber Riley</span> at the 2010 MLB All-Star Game.","highlight":"amber-riley_mlb-allstar-game_2010"},{"text":"Using the <strong>Diva Score</strong>, we can go phrase-by-phrase and pick out the performers who were doing the most and those that make you say they “<a href=https://www.youtube.com/watch?v=rNM5HW13_O8​​>ain’t no diva</a>.” Click on the faces of the certified top divas (plus our picks) to hear their interpretation of each phrase."}],"featured":[{"id":"anthony-hamilton_nba-allstar-game_2019","type":"top"},{"id":"chaka-khan_nba-allstar-game_2020","type":"top"},{"id":"hunter-hayes_world-series_2016","type":"top"}]},{"i":"1","type":"phrase","phraseI":"1","lyrics":"by the dawns early light","steps":[{"text":"Most performers don’t really get going until the last half of the song so these first few phrases will be comparatively tame, but there are still some notable exceptions like <span class=playable data-id=anthony-hamilton_nba-allstar-game_2019>Anthony Hamilton’s</span> 2019 NBA All-Star Game performance. He’s basically singing a different melody."}],"featured":[{"id":"anthony-hamilton_nba-allstar-game_2019","type":"top"}]},{"i":"2","type":"chart","phraseI":"1","chart":"phrase","text":"Here are the phrases ordered by average Diva Score instead of the order in which they are sung. Phrases with the highest scores come toward the back half of the anthem. Makes sense — the vocal fireworks explode around the “bombs are bursting in air.”"},{"i":"3","type":"phrase","phraseI":"2","lyrics":"what so proudly we hailed","steps":[{"text":"Let’s see how <span class=playable data-id=fergie_nba-allstar-game_2018>Fergie</span> is doing. Her performance at the 2018 NBA All-Star Game is surprisingly pretty tame Diva Score-wise. Sadly, we can’t capture anyone’s visceral emotional response to a performance, or just when someone manages to pronounce every word in the weirdest sultry way possible."}],"featured":[{"id":"fantasia_ncaa-football-championship_2023","type":"top"},{"id":"chaka-khan_nba-allstar-game_2020","type":"top"},{"id":"luke-bryan_super-bowl_2017","type":"top"},{"id":"fergie_nba-allstar-game_2018","type":"our-pick"}]},{"i":"4","type":"chart","phraseI":"2","chart":"event","text":"The NBA All-Star Game has hosted more than a handful of memorable national anthem performances over the years — from Marvin Gaye to Fergie. We found that basketball games yielded higher Diva Scores than other sporting events (football, baseball, and hockey) and political events (presidential inaugurations, party conventions, and July 4th celebrations). These divas came to play."},{"i":"5","type":"phrase","phraseI":"3","lyrics":"at the twilight’s last gleaming","steps":[{"text":"Not sure yet what I have to say about this. Possibly scooping. Redo Stapleton."}],"featured":[{"id":"anthony-hamilton_nba-allstar-game_2019","type":"top"},{"id":"chris-stapleton_super-bowl_2023","type":"top"},{"id":"john-legend_nba-allstar-game_2013","type":"top"}]},{"i":"6","type":"phrase","phraseI":"4","lyrics":"whose broad stripes and bright stars","steps":[{"text":"Not sure yet what I have to say about this. RNB"}],"featured":[{"id":"aretha-franklin_world-series_1993","type":"top"},{"id":"aaron-lewis_world-series_2014","type":"top"},{"id":"usher_nba-finals_2015","type":"top"}]},{"i":"7","type":"chart","phraseI":"4","chart":"genre","text":"Texty texty texty"},{"i":"8","type":"phrase","phraseI":"5","lyrics":"through the perilous fight","steps":[{"text":"To come!"}],"featured":[{"id":"anthony-hamilton_nba-allstar-game_2019","type":"top"},{"id":"john-oates_world-series_2008","type":"top"},{"id":"marvin-gaye_nba-allstar-game_1983","type":"top"},{"id":"jessica-simpson_nba-allstar-game_2001","type":"our-pick"}]},{"i":"9","type":"phrase","phraseI":"6","lyrics":"oer the ramparts we watched","steps":[{"text":"Skip"}],"featured":[{"id":"chaka-khan_nba-allstar-game_2020","type":"top"},{"id":"marvin-gaye_nba-allstar-game_1983","type":"top"},{"id":"jewel_nba-allstar-game_2023","type":"top"},{"id":"christina-aguilera_super-bowl_2011","type":"our-pick"},{"id":"eric-burton_world-series_2022","type":"our-pick"}]},{"i":"10","type":"phrase","phraseI":"7","lyrics":"were so gallantly streaming","steps":[{"text":"Skip"}],"featured":[{"id":"anthony-hamilton_nba-allstar-game_2019","type":"top"},{"id":"eric-burton_world-series_2022","type":"top"},{"id":"dierks-bentley_stanley-cup-playoffs_2017","type":"top"}]},{"i":"11","type":"phrase","phraseI":"8","lyrics":"and the rocket’s red glare","steps":[{"text":"Keys"}],"featured":[{"id":"chloe-bailey_world-series_2022","type":"top"},{"id":"chaka-khan_nba-allstar-game_2020","type":"top"},{"id":"patti-labelle_world-series_2008","type":"top"},{"id":"demi-lovato_world-series_2015","type":"our-pick"}]},{"i":"12","type":"phrase","phraseI":"9","lyrics":"the bombs bursting in air","steps":[{"text":"Not sure"}],"featured":[{"id":"kelly-clarkson_world-series_2010","type":"top"},{"id":"cassadee-pope_stanley-cup-playoffs_2023","type":"top"},{"id":"chaka-khan_nba-allstar-game_2020","type":"top"}]},{"i":"13","type":"phrase","phraseI":"10","lyrics":"gave proof through the night","steps":[{"text":"Repeat performers"}],"featured":[{"id":"chris-stapleton_super-bowl_2023","type":"top"},{"id":"demi-lovato_world-series_2012","type":"top"},{"id":"peabo-bryson_world-series_1992","type":"top"}]},{"i":"14","type":"phrase","phraseI":"11","lyrics":"that our flag was still there","steps":[{"text":"Two inaugurations + 2 gagas"}],"featured":[{"id":"lady-gaga_inauguration_2021","type":"top"},{"id":"beyonce_inauguration_2013","type":"top"},{"id":"lady-gaga_super-bowl_2016","type":"top"}]},{"i":"15","type":"phrase","phraseI":"12","lyrics":"o say does that star spangled","steps":[{"text":"Fergie"}],"featured":[{"id":"cher_super-bowl_1999","type":"top"},{"id":"lady-gaga_super-bowl_2016","type":"top"},{"id":"fergie_nba-allstar-game_2018","type":"top"}]},{"i":"16","type":"phrase","phraseI":"13","lyrics":"banner yet wave","steps":[{"text":"Quick, Jazmine"}],"featured":[{"id":"chaka-khan_nba-allstar-game_2020","type":"top"},{"id":"mary-j-blige_world-series_2009","type":"top"},{"id":"patti-labelle_world-series_2008","type":"top"}]},{"i":"17","type":"phrase","phraseI":"14","lyrics":"oer the land of the free","steps":[{"text":"What % go up the octave?"}],"featured":[{"id":"nicole-scherzinger_world-series_2019","type":"top"},{"id":"patti-labelle_world-series_2008","type":"top"},{"id":"renee-fleming_super-bowl_2014","type":"top"},{"id":"steven-tyler_indy-500_2001","type":"our-pick"}]},{"i":"18","type":"phrase","phraseI":"15","lyrics":"and the home of the brave","steps":[{"text":"Who holds the last note the longest?"}],"featured":[{"id":"renee-fleming_super-bowl_2014","type":"top"},{"id":"demi-lovato_world-series_2015","type":"top"},{"id":"idina-menzel_mlb-allstar-game_2014","type":"top"}]}],"methods":[{"type":"text","value":"To build a catalog of celebrity national anthem performances, we consulted <a href=https://www.avclub.com/best-national-anthem-performances-ranked-1850596161>several</a> <a href=https://www.billboard.com/lists/best-super-bowl-national-anthem-performances/>best-of</a> <a href=https://americansongwriter.com/the-12-best-national-anthem-performances-since-jimi-hendrix-at-woodstock/>lists</a>, and collected performances from major sporting and political events like the Super Bowl, the World Series, and the presidential inauguration from 1980 on. We also included a few notable anthem performances prior to 1980."},{"type":"text","value":"We then set out to find a suitable audio/video recording of the performance on YouTube. We were able to find roughly 180 performances. Using a <a href=https://ytmp3.nu/CNtD/>free online converter</a>, we extracted mp3 audio files from each YouTube link. We then manually trimmed the mp3 audio files so that they started right before the first word in the anthem and ended after the last. The trimmed audio was then uploaded to an AI-powered <a href=https://vocalremover.org/>Vocal Remover</a> program to isolate the vocals from the rest of the audio."},{"type":"text","value":"Once we had the isolated vocal files, we loaded them into <a href=https://www.sonicvisualiser.org/tony/>Tony</a>, an open source melody transcription tool developed by the Centre for Digital Music at Queen Mary, University of London. Along with 4 additional data assistants (Amel Awadelkarim, Dustin D’Andrea, Noah Fagan, and George McIntire), we listened to each vocal track and manually removed errant sounds (crowd noise, echos, jet flyovers, band accompaniments) and corrected pitch (usually moving the notes up or down an octave). Some songs were dropped at this stage due to overall poor audio quality."},{"type":"text","value":"We then exported the notes data and pitch data (the lines you see in this piece). To get exact timestamps for each word and phrase, we manually tagged the notes data with each word in the lyrics (“O”, “say”, “can”, “you”, “see”). We split the song into 16 phrases at natural pauses or breaths. To verify the timestamps of each phrase, we built a tool that allowed us to listen and manually tag start and stop times. Some specific phrases for specific performances were also dropped at this stage due to poor audio quality. This process took over 100 hours of work and we couldn’t have done it without our data assistants, so thank you!"},{"type":"text","value":"For each phrase, we used a Dynamic Time Warping (DTW) algorithm to compare it to the corresponding phrase in a “standard” performance of the National Anthem — in this case, an <a href=https://upload.wikimedia.org/wikipedia/commons/6/65/Star_Spangled_Banner_instrumental.ogg>instrumental by the United States Navy Band</a>. DTW calculates the cumulative distance between the performer’s rendition and the standard at various points along the length of the phrase. In other words, it measures the amount a performer deviates from the standard melody, giving us the Diva Score for each phrase. The Diva Score for the full performance is a sum of the Diva Scores by phrase."},{"type":"text","value":"Because the note data and the pitch data exported from Tony were at the sub-millisecond level, we had to compress the data in order to display it. To do this we took the average value for each millisecond, removing any zero values. The charts in this piece are a simplification of the full pitch data, but they still accurately reflect what you hear while listening to the audio."},{"type":"text","value":"Thank you also to our colleague <a href=https://pudding.cool/author/kevin-litman-navarro/>Kevin Litman-Narvarro</a> who originally planted the idea of looking into National Anthem performances."}]}